<?php
use App\Manage;
use Illuminate\Database\Seeder;


class ManagesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $compName_array = array(
            '株式会社　セレスト',
            '株式会社　ジャストセレモニー',
            '株式会社　葬祭センター',
            '有限会社　アースセレモ',
            '有限会社　同友社商事',
            '株式会社　プロマインド',
            '株式会社　信愛商事',
            '株式会社　同友社セレモニー',
            '株式会社　東京青空',
        );
        $compadd_array = array(
            '東京都板橋区桜川2-6-11',
            '東京都板橋区大山東町54-7',
            '板橋区常盤台4-37-10',
            '東京都墨田区錦糸1-2-6',
            '東京都文京区千駄木5-49-2',
            '東京都文京区千駄木5-49-2',
            '東京都墨田区江東橋2-3-4',
            '東京都新宿区四谷4-22-83',
        );
        $compTel1_array = array(
            '03-6783-0986',
            '03-6903-0009',
            '03-6781-9174',
            '03-6781-9181',
            '03-6323-6035',
            '03-6781-9180',
            '03-6671-3180',
            '03-6313-9971',
            '03-6338-8149'
        );
        $compTel2_array = array(
            '03-6781-9179',
            '03-6781-9179',
            '03-6781-9179',
            '03-6781-9179',
            '03-6781-9179',
            '03-6781-9179',
            '03-6781-9179',
            '03-6781-9179',
            '03-6781-9179'
        );
        $celName_array = array(
            '戸田斎場(３Ｆ)',
            '戸田斎場(４Ｆ)',
            '戸田斎場(別館)',
            '四ツ木斎場',
            '落合斎場',
            '町屋斎場',
            '堀ノ内斎場',
            '桐ヶ谷斎場（雪）',
            '桐ヶ谷斎場（鶴）',
            '桐ヶ谷斎場（雲）',
            '代々幡斎場',
            '舟渡斎場',
            '舟渡斎場（区外）',
            '蓮根レインボーホール',
            '蓮根レインボーホール（区外）'
        );
        $celAdd_array = array(
            '東京都板橋区舟渡４丁目１５−１',
            '東京都板橋区舟渡４丁目１５−１',
            '東京都板橋区舟渡４丁目１５−１',
            '東京都葛飾区白鳥２丁目９−１',
            '東京都新宿区上落合３丁目３４−１２',
            '東京都荒川区町屋１丁目２３−４',
            '東京都杉並区梅里１丁目２−２７',
            '東京都品川区西五反田５丁目３２−２０',
            '東京都品川区西五反田５丁目３２−２０',
            '東京都品川区西五反田５丁目３２−２０',
            '東京都渋谷区西原２丁目４２−１',
            '東京都板橋区舟渡４丁目１４−６',
            '東京都板橋区舟渡４丁目１４−６',
            '東京都板橋区蓮根２丁目１９−１２',
            '東京都板橋区蓮根２丁目１９−１２'
        );
        $celTel_array = array(
            '03-3966-4241',
            '03-3966-4241',
            '03-3966-4241',
            '03-3601-0424',
            '03-3361-4042',
            '03-3892-0311',
            '03-3311-2324',
            '03-3491-0213',
            '03-3491-0213',
            '03-3491-0213',
            '03-3466-1006',
            '03-3967-6420',
            '03-3967-6420',
            '03-3965-2321',
            '03-3965-2321'
        );
        $creName_array = array(
            '桐ヶ谷斎場',
            '代々幡斎場',
            '堀ノ内斎場',
            '町屋斎場',
            '落合斎場',
            '四ツ木斎場',
            '戸田火葬場',
            '谷塚斎場',
            '日華斎場',
            'かわさき北部斎苑'
        );
        $creAdd_array = array(
            '東京都品川区西五反田5丁目32番20号',
            '東京都渋谷区西原2丁目42番1号',
            '東京都杉並区梅里1丁目2番27号',
            '東京都荒川区町屋1丁目23番4号',
            '東京都新宿区上落合3-34-12',
            '東京都葛飾区白鳥2-9-1',
            '東京都板橋区舟渡4-15-1',
            '埼玉県草加市瀬崎4-6-36',
            '東京都府中市多磨町2丁目１番１号',
            '神奈川県川崎市高津区下作延６丁目18番1号'
        );
        $creTel_array = array(
            '03-3491-0213',
            '03-3466-1006',
            '03-3311-2324',
            '03-3892-0311',
            '03-3368-4058',
            '03-3601-0424',
            '03-3966-4241',
            '048-922-2342',
            '042-361-2174',
            '044-822-3171',
        );

        for($i = 0; $i<8; $i++){
            Manage::create([
                'type' => 1,
                'name' => $compName_array[$i],
                'address' => $compadd_array[$i],
                'tel1' => $compTel1_array[$i],
                'tel2' => $compTel2_array[$i]
            ]);
        }
        for($i = 0; $i<15; $i++){
            Manage::create([
                'type' => 2,
                'name' => $celName_array[$i],
                'address' => $celAdd_array[$i],
                'tel1' => $celTel_array[$i],
                'tel2' => ""
            ]);
        }
        for($i = 0; $i<10; $i++){
            Manage::create([
                'type' => 3,
                'name' => $creName_array[$i],
                'address' => $creAdd_array[$i],
                'tel1' => $creTel_array[$i],
                'tel2' => ""
            ]);
        }
        
    }
}
